In [1]:
#import pandas

import pandas as pd

In [2]:
#Import Modules
import numpy as np
import os
import csv

In [3]:
#Set path for file

csvpath = os.path.join("Resources", "purchase_data.csv")

In [4]:
#Set table to data frame

df_purchase_data = pd.read_csv(csvpath)
df_purchase_data.head()

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
#DETERMINE PLAYER COUNT

unique_players = pd.DataFrame([{"Individual Players": df_purchase_data["SN"].nunique()}])
unique_players

   Individual Players
0                 576

In [6]:
#ANALYZE PURCHASING TOTALS:
#Number of Unique Items, Average Purchase Price, Total Number of Purchases, Total Revenue

In [7]:
#Number of unique items
unique_items = pd.DataFrame([{"Item Name": df_purchase_data["Item_Name"].nunique()}])
unique_items

   Item Name
0        179

In [8]:
#Average Purchase Price:
purchase_price = pd.DataFrame([{"Average Price": df_purchase_data["Price"].mean()}])
#Round average purchase price:
purchase_price.round(2)

   Average Price
0           3.05

In [9]:
#Total Number of Purchases:
total_purchases = pd.DataFrame([{"Total Purchases": df_purchase_data["Price"].count()}])
total_purchases

   Total Purchases
0              780

In [10]:
#Total Revenue
total_revenue = df_purchase_data["Price"].sum()
total_revenue

2379.77

In [11]:
#ANALYZE GENDER DEMOGRAPHICS:
# % and Count of Male Players, 
# % and Count of Female Players, 
# % and Count of Other/Non-disclosed Players

In [12]:
#Count of players by gender category, and percentage by gender

#Create dataframe that indicates the number of each gender category                  
Gender = df_purchase_data.groupby("Gender").nunique()
Male = Gender.iloc[1,1]
Female = Gender.iloc[0,1]
Other = Gender.iloc[2,1]

#Create a dataframe that calculates the totals and percentages of each gender category
df_percentage = pd.DataFrame({
    "Gender": ["Male", "Female", "Other/Not Disclosed"],
    "Total": [Male, Female, Other],
    "Percentage": [100*Male/df_purchase_data["SN"].nunique(), 
                    100*Female/df_purchase_data["SN"].nunique(), 
                    100*Other/df_purchase_data["SN"].nunique()]
})

df_percentage.loc["Total Players"]= df_percentage.sum(axis=0,numeric_only=True)
df_percentage.loc["Total Players", "Gender"] = ""

#Format the percentages to two decimals
df_percentage = df_percentage.round(2)

#Print out the total of each gender category and its percentage in a table
df_percentage

                            Gender  Total  Percentage
0                             Male  484.0       84.03
1                           Female   81.0       14.06
2              Other/Not Disclosed   11.0        1.91
Total Players                       576.0      100.00

In [13]:
#Analyze Purchasing by Gender: 

#For each gender, determine
#Purchase Count, Average Purchase Price, Total Purchase Value

In [14]:
df_gender_2 = df_purchase_data.groupby('Gender')

Total_Purchase_Counts = round(df_gender_2['Price'].count(), 0)
Avg_Purchase_Price = round(df_gender_2['Price'].mean(), 2)
Total_Purchase_Values = round(df_gender_2['Price'].sum(), 2)
Purchase_Value_Per_Gender = round(Total_Purchase_Values / Total_Purchase_Counts, 2)

summary_dataframe2 = pd.DataFrame([Total_Purchase_Counts, Avg_Purchase_Price, Total_Purchase_Values, Purchase_Value_Per_Gender])
summary2 = summary_dataframe2.T
summary2.columns = ['Total Purchase Count', 'Average Purchase Price', 'Total Purchase Value', 'Avg Total Purchase per Person']
summary2

,Total Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113.0,3.20,361.94,3.20
Male,652.0,3.02,1967.64,3.02
Other / Non-Disclosed,15.0,3.35,50.19,3.35

In [24]:
#ANALYZE AGE DEMOGRAPHICS:

In [26]:
#* The below each broken into bins of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)
#  * Purchase Count
#  * Average Purchase Price
#  * Total Purchase Value
#  * Average Purchase Total per Person by Age Group

In [27]:
#Determine age ranges broken into bins of 4 years
Age = df_purchase_data.groupby("SN").mean()
groups = [0, 9, 14, 19, 24, 29, 34, 39,  np.inf]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
Age["Bin"] = pd.cut(Age["Age"], groups, labels=group_names)
Bins = pd.DataFrame({"Total Count": Age.groupby("Bin")["Age"].count()})
Bins["Percentage of Players"] = 100* Bins["Total Count"]/Bins["Total Count"].sum()
Bins_formatted = Bins
Bins_formatted["Percentage of Players"] = Bins_formatted["Percentage of Players"].map("{:.2f}%".format)
Bins_formatted

       Total Count Percentage of Players
Bin
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

In [42]:
#For each age group (bin), determine:
#  * Purchase Count
#  * Average Purchase Price
#  * Total Purchase Value
#  * Average Purchase Total per Person by Age Group

df_purchase_data["Bin"] = pd.cut(df_purchase_data["Age"], groups, labels=group_names)
df_purchase_data_grouped = pd.DataFrame({
                    "Purchase Count": df_purchase_data.groupby("Bin")["Price"].count(),
                    "Average Purchase Price": round(df_purchase_data.groupby("Bin")["Price"].mean(),2),
                    "Total Purchase Value": 
                        df_purchase_data.groupby("Bin")["Price"].mean()*
                        df_purchase_data.groupby("Bin")["Price"].count(),
                    "Average Total per Person":
                        round(df_purchase_data.groupby("Bin")["Price"].mean()*
                        df_purchase_data.groupby("Bin")["Price"].count()/Bins["Total Count"],2)
                        })
df_purchase_data_grouped

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total per Person
Bin,,,,
<10,23,3.35,77.13,4.54
10-14,28,2.96,82.78,3.76
15-19,136,3.04,412.89,3.86
20-24,365,3.05,1114.06,4.32
25-29,101,2.90,293.00,3.81
30-34,73,2.93,214.00,4.12
35-39,41,3.60,147.67,4.76
40+,13,2.94,38.24,3.19

In [290]:
#Within age bins, get purchase count

#Creating a group based off of the bins/clean data of NaN's
#df_age_groups = df_purchase_data.apply(pd.to_numeric, errors = 'coerce')
#df_age_groups = df_purchase_data.dropna()
#df_age_groups = df_purchase_data.reset_index(drop=True)
#df_avg_tot_purch = df_purchase_data.groupby(["SN", "Gender"])["Price"].agg(lambda x: x.unique().mean())
#df_avg_tot_purch.head()

#df_avg_tot_purch[df_avg_tot_purch.index.isin(["Male"], level="Gender")]
test = pd.DataFrame (df_purchase_data, columns = )

df_age_purch = df_purchase_data.groupby(["Age Groups", "Purchase_ID"]).count()
print(df_age_purch)

#HOW DO I GET RID OF ALL THESE NaNs?????? I tried a million ways.

SyntaxError: invalid syntax (<ipython-input-290-5ad5f45ad7bf>, line 11)

In [291]:
#Within age bin 1, get average purchase price total per person

#df_avg_tot_purch = df_purchase_data.groupby(["SN", "Gender"])["Price"].agg(lambda x: x.unique().mean())
#df_avg_tot_purch.head()

#df_avg_tot_purch[df_avg_tot_purch.index.isin(["Male"], level="Gender")]

In [292]:
#Within age groups, get average purchase total

In [293]:
#ANALYZE TOP SPENDERS:

In [315]:
#Determine top 5 spenders by purchase price

top_spenders_df = df_purchase_data.sort_values(by = ['Price'], ascending=[False])

df_test = top_spenders_df.head(5)
top_spenders_df.head(5)

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price,Age Groups
554,554,Dyally87,22,Male,63,Stormfury Mace,4.99,19-22
189,189,Hiasri33,23,Male,63,Stormfury Mace,4.99,23-26
110,110,Ririp86,25,Male,139,"Mercy, Katana of Dismay",4.94,23-26
246,246,Lirtilsa71,24,Male,139,"Mercy, Katana of Dismay",4.94,23-26
493,493,Chanirrasta87,14,Male,139,"Mercy, Katana of Dismay",4.94,11-14

In [332]:
#List them in a table with the following information
#SN, Purchase Count, Average Purchase Price, Total Purchase Price
#drop columns not needed from original table
df_top_spenders_table = pd.DataFrame({
    "SN":df_test["SN"], 
    "Purchase_Count":df_test["Purchase_ID"].count(),
    "Avg_Purchase_Price":[4.99/5, 4.99/5, 4.94/5, 4.94/5, 4.94/5],
    "Total Purchase Price":df_test["Price"]
})
df_top_spenders_table

                SN  Purchase_Count  Avg_Purchase_Price  Total Purchase Price
554       Dyally87               5               0.998                  4.99
189       Hiasri33               5               0.998                  4.99
110        Ririp86               5               0.988                  4.94
246     Lirtilsa71               5               0.988                  4.94
493  Chanirrasta87               5               0.988                  4.94

In [ ]:
#DETERMINE MOST POPULAR ITEMS

In [340]:
#Identify the 5 most popular items by purchase count
num_items_df = df_purchase_data.groupby("Item_Name").count()
pop_items_df = df_purchase_data.sort_values(by = ['Item_Name'], ascending=[False])
num_items_df.head(5)

,Purchase_ID,SN,Age,Gender,Item_ID,Price,Age Groups
Item_Name,,,,,,,
Abyssal Shard,5,5,5,5,5,5,5
"Aetherius, Boon of the Blessed",5,5,5,5,5,5,5
Agatha,6,6,6,6,6,6,6
Alpha,3,3,3,3,3,3,3
"Alpha, Oath of Zeal",3,3,3,3,3,3,3

In [352]:
#List them in a table with the following information
#Item ID, Item Name, #Purchase Count, #Item Price, #Total Purchase Value
df_pop_items_table = pd.DataFrame({
    "Item_ID":[162, 137, 120, 130, 79], 
    "Purchase_Count":[5,5,6,3,3],
    "Item Price":[2.67, 3.39, 3.08, 2.07, 4.05],
    "Total Purchase Value":[13.35, 16.95, 18.48, 6.21, 12.05]
})
df_pop_items_table

   Item_ID  Purchase_Count  Item Price  Total Purchase Value
0      162               5        2.67                 13.35
1      137               5        3.39                 16.95
2      120               6        3.08                 18.48
3      130               3        2.07                  6.21
4       79               3        4.05                 12.05

In [ ]:
#DETERMINE MOST PROFITABLE ITEMS

In [371]:
#Identify the 5 most profitable items by total purchase value
prof_items_df = df_purchase_data.groupby("Price")["Item_Name"].nunique()
profitable_items_df = df_purchase_data.sort_values(by = ['Price'], ascending=[False])

profitable_items_df.head(5)

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price,Age Groups
554,554,Dyally87,22,Male,63,Stormfury Mace,4.99,19-22
189,189,Hiasri33,23,Male,63,Stormfury Mace,4.99,23-26
110,110,Ririp86,25,Male,139,"Mercy, Katana of Dismay",4.94,23-26
246,246,Lirtilsa71,24,Male,139,"Mercy, Katana of Dismay",4.94,23-26
493,493,Chanirrasta87,14,Male,139,"Mercy, Katana of Dismay",4.94,11-14

In [ ]:
#List them in a table with the following information
#Item ID, Item Name, Purchase Count, Itemm Price, Total Purchase Value